app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    data = create_route
    @users = User.all