app/mailboxes/support_mailbox.rb

INSERT INTO "tickets" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Here you are"], ["body", "body"], ["user_id", 9], ["created_at", "2021-10-12 11:17:08.343820"], ["updated_at", "2021-10-12 11:17:08.343820"]]
---
  def process
    return unless user.present?

    Ticket.create(user: user, title: mail.subject, body: mail.decoded)

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "bablu@gmail.com"], ["LIMIT", 1]]
---
  def user
    @user ||= User.find_by email: mail.from